In [1]:
import pandas as pd

In [11]:
df1 = pd.DataFrame(
    {
        'a': ['nombre 1', 'nombre 2', 'nombre 4'],
        'b': [10,20,30]
    }
)
df2 = pd.DataFrame(
    {
        'a': ['nombre 2', 'nombre 3', 'nombre 5'],
        'b': [100,200,300]
    }
)

In [19]:
pd.merge(df1,df2, on='a', how='outer')

          a   b_x    b_y
0  nombre 1  10.0    NaN
1  nombre 2  20.0  100.0
2  nombre 4  30.0    NaN
3  nombre 3   NaN  200.0
4  nombre 5   NaN  300.0

In [10]:
pd.concat([df1,df2], axis = 0)

          a    b
0  nombre 1   10
1  nombre 2   20
2  nombre 4   30
0  nombre 2  100
1  nombre 3  200
2  nombre 5  300

In [9]:
pd.concat([df1,df2], axis = 1)

          a   b         a    b
0  nombre 1  10  nombre 2  100
1  nombre 2  20  nombre 3  200
2  nombre 4  30  nombre 5  300

In [14]:
df1

          a   b
0  nombre 1  10
1  nombre 2  20
2  nombre 4  30

In [15]:
df2

          a    b
0  nombre 2  100
1  nombre 3  200
2  nombre 5  300